<a href="https://colab.research.google.com/github/maithstartup/Notebooks-Practical-ML-Beginners/blob/master/pandas/groupby_%26_soriting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# Groupby

In [2]:


ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Position': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

In [3]:
df

      Team  Position  Year  Points
0   Riders         1  2014     876
1   Riders         2  2015     789
2   Devils         2  2014     863
3   Devils         3  2015     673
4    Kings         3  2014     741
5    Kings         4  2015     812
6    Kings         1  2016     756
7    Kings         1  2017     788
8   Riders         2  2016     694
9   Royals         4  2014     701
10  Royals         1  2015     804
11  Riders         2  2017     690

In [4]:
df.groupby('Team')

In [5]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 5, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64')}

In [6]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2015): Int64Index([5], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64')}

In [7]:
grouped = df.groupby('Year')

for name,group in grouped:
   print(name)
   print(group)

2014
     Team  Position  Year  Points
0  Riders         1  2014     876
2  Devils         2  2014     863
4   Kings         3  2014     741
9  Royals         4  2014     701
2015
      Team  Position  Year  Points
1   Riders         2  2015     789
3   Devils         3  2015     673
5    Kings         4  2015     812
10  Royals         1  2015     804
2016
     Team  Position  Year  Points
6   Kings         1  2016     756
8  Riders         2  2016     694
2017
      Team  Position  Year  Points
7    Kings         1  2017     788
11  Riders         2  2017     690

In [9]:
grouped.get_group(2014)

     Team  Position  Year  Points
0  Riders         1  2014     876
2  Devils         2  2014     863
4   Kings         3  2014     741
9  Royals         4  2014     701

Aggregations

In [10]:
grouped = df.groupby('Year')
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [ ]:
df.groupby('Year')["Points"].aggregate("mean")

In [11]:
df.groupby('Year').aggregate("mean")

      Position  Points
Year
2014       2.5  795.25
2015       2.5  769.50
2016       1.5  725.00
2017       1.5  739.00

In [12]:
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3049  762.25   88.567771
Royals  1505  752.50   72.831998

Transformation

In [13]:
grouped = df.groupby('Team') 
grouped.transform(lambda x: x.mean())

    Position    Year  Points
0       1.75  2015.5  762.25
1       1.75  2015.5  762.25
2       2.50  2014.5  768.00
3       2.50  2014.5  768.00
4       2.25  2015.5  774.25
5       2.25  2015.5  774.25
6       2.25  2015.5  774.25
7       2.25  2015.5  774.25
8       1.75  2015.5  762.25
9       2.50  2014.5  752.50
10      2.50  2014.5  752.50
11      1.75  2015.5  762.25

In [14]:
df["Year_points"]=df.groupby("Year")["Points"].transform(lambda x:x.sum())

In [15]:
df

      Team  Position  Year  Points  Year_points
0   Riders         1  2014     876         3181
1   Riders         2  2015     789         3078
2   Devils         2  2014     863         3181
3   Devils         3  2015     673         3078
4    Kings         3  2014     741         3181
5    Kings         4  2015     812         3078
6    Kings         1  2016     756         1450
7    Kings         1  2017     788         1478
8   Riders         2  2016     694         1450
9   Royals         4  2014     701         3181
10  Royals         1  2015     804         3078
11  Riders         2  2017     690         1478

Filtration

In [19]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 5, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64')}

In [17]:
df.groupby('Team').filter(lambda x: len(x) <= 3)

      Team  Position  Year  Points  Year_points
2   Devils         2  2014     863         3181
3   Devils         3  2015     673         3078
9   Royals         4  2014     701         3181
10  Royals         1  2015     804         3078

In [21]:
df.groupby("Team").filter(lambda x:x['Points'].mean()<770)

      Team  Position  Year  Points  Year_points
0   Riders         1  2014     876         3181
1   Riders         2  2015     789         3078
2   Devils         2  2014     863         3181
3   Devils         3  2015     673         3078
8   Riders         2  2016     694         1450
9   Royals         4  2014     701         3181
10  Royals         1  2015     804         3078
11  Riders         2  2017     690         1478

# Sorting

In [22]:
df

      Team  Position  Year  Points  Year_points
0   Riders         1  2014     876         3181
1   Riders         2  2015     789         3078
2   Devils         2  2014     863         3181
3   Devils         3  2015     673         3078
4    Kings         3  2014     741         3181
5    Kings         4  2015     812         3078
6    Kings         1  2016     756         1450
7    Kings         1  2017     788         1478
8   Riders         2  2016     694         1450
9   Royals         4  2014     701         3181
10  Royals         1  2015     804         3078
11  Riders         2  2017     690         1478

In [23]:
df.sort_values("Position")

      Team  Position  Year  Points  Year_points
0   Riders         1  2014     876         3181
6    Kings         1  2016     756         1450
7    Kings         1  2017     788         1478
10  Royals         1  2015     804         3078
1   Riders         2  2015     789         3078
2   Devils         2  2014     863         3181
8   Riders         2  2016     694         1450
11  Riders         2  2017     690         1478
3   Devils         3  2015     673         3078
4    Kings         3  2014     741         3181
5    Kings         4  2015     812         3078
9   Royals         4  2014     701         3181

In [28]:
df.sort_values("Year",ascending=False)

      Team  Position  Year  Points  Year_points
7    Kings         1  2017     788         1478
11  Riders         2  2017     690         1478
6    Kings         1  2016     756         1450
8   Riders         2  2016     694         1450
1   Riders         2  2015     789         3078
3   Devils         3  2015     673         3078
5    Kings         4  2015     812         3078
10  Royals         1  2015     804         3078
0   Riders         1  2014     876         3181
2   Devils         2  2014     863         3181
4    Kings         3  2014     741         3181
9   Royals         4  2014     701         3181

In [29]:
df2=df.sort_values(["Position","Points"],ascending=[True,False] )

In [30]:
df2

      Team  Position  Year  Points  Year_points
0   Riders         1  2014     876         3181
10  Royals         1  2015     804         3078
7    Kings         1  2017     788         1478
6    Kings         1  2016     756         1450
2   Devils         2  2014     863         3181
1   Riders         2  2015     789         3078
8   Riders         2  2016     694         1450
11  Riders         2  2017     690         1478
4    Kings         3  2014     741         3181
3   Devils         3  2015     673         3078
5    Kings         4  2015     812         3078
9   Royals         4  2014     701         3181

In [31]:
df2.sort_index(ascending=False)

      Team  Position  Year  Points  Year_points
11  Riders         2  2017     690         1478
10  Royals         1  2015     804         3078
9   Royals         4  2014     701         3181
8   Riders         2  2016     694         1450
7    Kings         1  2017     788         1478
6    Kings         1  2016     756         1450
5    Kings         4  2015     812         3078
4    Kings         3  2014     741         3181
3   Devils         3  2015     673         3078
2   Devils         2  2014     863         3181
1   Riders         2  2015     789         3078
0   Riders         1  2014     876         3181